{
 "navInicio": "Home",
  "navSobre": "About",
  "navSkills": "Skills",
  "navProjetos": "Projects",
  "navContato": "Contact",
  "heroGreeting": "Hello, my name is",
  "heroSubtitle": "A developer focused on creating incredible digital experiences. Welcome to my portfolio!",
  "heroButton": "View Projects",
  "aboutTitle": "About Me",
  "aboutSubtitle": "My Introduction",
  "aboutParagraph": "I am currently blending the academic foundation from my Information Systems degree at <a href='https://www.fho.edu.br/' target='_blank' class='json-link'>FHO</a> with hands-on experience from my IT internship at <a href='https://www.brascabos.com.br/' target='_blank' class='json-link'>Brascabos</a>. My work in network infrastructure and automation has given me a systemic, end-to-end view of how technology operates.\n\nI believe in continuous learning, which is why I constantly seek to expand my skills through personal projects and new studies. My primary goal is to channel this passion and knowledge into a software development role, where I can collaborate on creating impactful and scalable digital solutions.",
  "aboutButton": "Contact Me",
  "aboutSkillsTitle": "My Skills:",
  "aboutCoursesTitle": "Complementary Courses:",
  "skillsTitle": "Skills",
  "skillsSubtitle": "My Skills and Certifications:",
  "course1Name": "Complete Web Development",
  "course1Institution": "Udemy",
  "course1Duration": "120h",
  "course2Name": "Linux Fundamentals (RH104)",
  "course2Institution": "Red Hat",
  "course2Duration": "16h",
  "course3Name": "Introduction to Cybersecurity",
  "course3Institution": "Cisco Networking Academy",
  "course3Duration": "6h",
  "skills": {
    "HTML": "Full domain of semantic web page structuring, ensuring accessibility and search engine optimization.",
    "CSS": "Experience with responsive layouts using Flexbox and Grid, as well as advanced animations and pre-processors.",
    "JavaScript": "Solid knowledge of ES6+, DOM manipulation, and API consumption (Fetch/Axios) to create dynamic interactions.",
    "React": "Creation of reusable components, state management (Hooks, Context API), and development of SPAs (Single Page Applications).",
    "SQL": "Experience with data modeling and complex queries in relational databases like PostgreSQL and MySQL.",
    "Git": "Use for code versioning, branches, pull requests, and team collaboration via GitHub.",
    "C/C++": "Knowledge in low-level programming, data structures, and algorithms with C and C++.",
    "Java": "Development of robust and scalable applications with the Java ecosystem.",
    "PHP": "Experience in developing server-side web applications.",
    "Python": "Use of Python for task automation, scripting, and back-end development."
  },
  "courses": {
    "course1": "An all-in-one training program that consolidates 20 courses and 20 practical projects into a single journey. It covers the end-to-end web development ecosystem, from essential front-end technologies (HTML5, CSS3, Bootstrap, JavaScript) to robust back-end development with PHP and MySQL databases. The strong focus on hands-on projects ensures the application of knowledge in building a diverse and professional portfolio.",
    "course2": "Official Red Hat training (RH104) that provides a foundational understanding of the Linux operating system. This course covers essential command-line operations, file system navigation, user and group management, and basic security permissions, preparing for more advanced system administration tasks.",
    "course3": "A fundamental course that offers a comprehensive overview of the world of cybersecurity. It explores the essential principles of digital protection, including the identification of common threats like malware, phishing, and social engineering. The content covers notions of network security, cryptography, and best practices for protecting personal and corporate data."
  },
  "projectsTitle": "Projects",
  "projectsSubtitle": "My Recent Work",
  "project1Title": "e-Move",
  "project1Desc": "Intelligent charging platform and route optimizer for electric vehicles.",
  "project1Link": "View on GitHub",
  "contactTitle": "Contact",
  "contactSubtitle": "Get in Touch",
  "contactParagraph": "Open to freelance work and professional job opportunities, whether part-time or full-time. If your company is looking for a motivated and skilled developer, let’s talk!",
  "contactButton": "Send an Email",
  "footerText": "&copy; 2025 Felipe Giacomini Cocco. All rights reserved."
}
