{
  "navInicio": "Início",
  "navSobre": "Sobre",
  "navSkills": "Habilidades",
  "navProjetos": "Projetos",
  "navContato": "Contato",
  "heroGreeting": "Olá, meu nome é",
  "heroSubtitle": "Desenvolvedor focado em criar experiências digitais incríveis. Bem-vindo ao meu portfólio!",
  "heroButton": "Ver Projetos",
  "aboutTitle": "Sobre Mim",
  "aboutSubtitle": "Minha Introdução",
  "aboutParagraph": "Atualmente, uno a base acadêmica do meu curso de Sistemas de Informação na <a href='https://www.fho.edu.br/' target='_blank' class='json-link'>FHO</a> com a experiência prática do meu estágio em TI na <a href='https://www.brascabos.com.br/' target='_blank' class='json-link'>Brascabos</a>. Minha atuação em infraestrutura de redes e automação me proporcionou uma visão sistêmica sobre como a tecnologia funciona de ponta a ponta.\n\nAcredito na aprendizagem contínua e, por isso, busco constantemente expandir minhas competências através de projetos pessoais e novos estudos. Meu grande objetivo é direcionar essa paixão e conhecimento para a área de desenvolvimento de software, onde posso colaborar na criação de soluções digitais impactantes e escaláveis.",
  "aboutButton": "Fale Comigo",
  "aboutSkillsTitle": "Meus Conhecimentos:",
  "aboutCoursesTitle": "Cursos Complementares:",
  "skillsTitle": "Habilidades",
  "skillsSubtitle": "Meus Conhecimentos e Certificados",
  "course1Name": "Desenvolvimento Web Completo",
  "course1Institution": "Udemy",
  "course1Duration": "120h",
  "course2Name": "Linux Fundamentals (RH104)",
  "course2Institution": "Red Hat",
  "course2Duration": "16h",
  "course3Name": "Introdução à Cibersegurança",
  "course3Institution": "Cisco Networking Academy",
  "course3Duration": "6h",
  "skills": {
    "HTML": "Domínio completo da estruturação semântica de páginas web, garantindo acessibilidade e otimização para motores de busca.",
    "CSS": "Experiência com layouts responsivos usando Flexbox e Grid, além de animações avançadas.",
    "JavaScript": "Conhecimento sólido de ES6+, manipulação do DOM, e consumo de APIs (Fetch/Axios) para criar interações dinâmicas.",
    "React": "Criação de componentes reutilizáveis, gerenciamento de estado (Hooks, Context API) e desenvolvimento de SPAs (Single Page Applications).",
    "SQL": "Experiência com modelagem de dados e consultas em bancos de dados relacionais como PostgreSQL e MySQL.",
    "Git": "Uso para versionamento de código, branches, pull requests e colaboração em equipe via GitHub.",
    "C/C++": "Conhecimento em programação de baixo nível, estruturas de dados e algoritmos com C e C++.",
    "Java": "Desenvolvimento de aplicações robustas e escaláveis com o ecossistema Java.",
    "PHP": "Experiência no desenvolvimento de aplicações web do lado do servidor.",
    "Python": "Uso de Python para automação de tarefas, scripts e desenvolvimento de back-end."
  },
  "courses": {
    "course1": "Um programa de formação 'tudo em um' que consolida 20 cursos e 20 projetos práticos em uma única jornada. Abrange o ecossistema de desenvolvimento web de ponta a ponta, desde as tecnologias essenciais de front-end (HTML5, CSS3, Bootstrap, JavaScript) até o desenvolvimento back-end robusto com PHP e bancos de dados MySQL. O forte foco em projetos práticos garante a aplicação do conhecimento na construção de um portfólio diversificado e profissional.",
    "course2": "Treinamento oficial da Red Hat (RH104) que fornece uma compreensão fundamental do sistema operacional Linux. Este curso abrange operações essenciais de linha de comando, navegação no sistema de arquivos, gerenciamento de usuários e grupos, e permissões básicas de segurança, preparando para tarefas mais avançadas de administração de sistemas.",
    "course3": "Curso fundamental que oferece uma visão abrangente sobre o mundo da cibersegurança. Explora os princípios essenciais de proteção digital, incluindo a identificação de ameaças comuns como malware, phishing e engenharia social. O conteúdo abrange noções de segurança de redes, criptografia e as melhores práticas para a proteção de dados pessoais e corporativos."
  },
  "projectsTitle": "Projetos",
  "projectsSubtitle": "Meus Trabalhos Recentes",
  "project1Title": "e-Move",
  "project1Desc": "Plataforma inteligente de recarga e otimizador de trajeto para veículos elétricos.",
  "project1Link": "Ver no GitHub",
  "contactTitle": "Contato",
  "contactSubtitle": "Entre em Contato",
  "contactParagraph": "Estou disponível para trabalhos freelance e oportunidades profissionais em tempo parcial ou integral. Se sua empresa está em busca de alguém comprometido e com vontade de crescer, vamos conversar!",
  "contactButton": "Mande um E-mail",
  "footerText": "&copy; 2025 Felipe Giacomini Cocco. Todos os direitos reservados."
}
